** use function from development module
must be loaded in the environment first before calling from org mode?

#+BEGIN_SRC python :session *Python* :results output
import queries_for_tournament
#+END_SRC

#+RESULTS:
: [(1, 'Bill Borzo                         ', 0, 0), (2, 'Jeff Jeffries                      ', 0, 0), (3, 'Dave Davies                        ', 0, 0), (4, 'Steve Stevens                      ', 0, 0)]

#+BEGIN_SRC python :session *Python* :results output
queries_for_tournament.doDB()
#+END_SRC




#+RESULTS:
: (1, 'Bill Borzo                         ')
: (2, 'Jeff Jeffries                      ')
: (3, 'Dave Davies                        ')
: (4, 'Steve Stevens                      ')

#+RESULTS:
: (1, 'Bill Borzo                         ')
: (2, 'Jeff Jeffries                      ')
: (3, 'Dave Davies                        ')
: (4, 'Steve Stevens                      ')

** call db function from org file
#+BEGIN_SRC python :session *Python* :results output
showAllPLayers()
#+END_SRC

#+RESULTS:
: (218, 'Fluttershy', 0, 1)
: (217, 'Twilight Sparkle', 1, 1)
: (220, 'Pinkie Pie', 0, 1)
: (219, 'Applejack', 1, 1)

: (1, 'Bill Borzo                         ', 0, 0)
: (2, 'Jeff Jeffries                      ', 0, 0)
: (3, 'Dave Davies                        ', 0, 0)
: (4, 'Steve Stevens                      ', 0, 0)

*** addStandardPlayers
#+BEGIN_SRC python :session *Python* :results output
def addStandardPlayers():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    query = "insert into players1 values(1, 'Bill Borzo', 0, 0); insert into players1 values(2, 'Jeff Jeffries', 0, 0); insert into players1 values(3, 'Dave Davies', 0, 0); insert into players1 values(4, 'Steve Stevens', 0, 0);"
    c.execute(query)
    DB.commit()
    DB.close()

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sql
insert into players2 values('Bill Borzo', 0, 0); insert into players2 values('Jeff Jeffries', 0, 0); insert into players2 values('Dave Davies', 0, 0); insert into players2 values('Steve Stevens', 0, 0);
#+END_SRC
#+BEGIN_SRC python :session *Python* :results output
addStandardPlayers()
#+END_SRC

#+RESULTS:
#+BEGIN_SRC python :session *Python* :results output
def addStandardPlayers():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    query = "insert into players1 values(1, 'Bill Borzo', 0, 0); insert into players1 values(2, 'Jeff Jeffries', 0, 0); insert into players1 values(3, 'Dave Davies', 0, 0); insert into players1 values(4, 'Steve Stevens', 0, 0);"
    c.execute(query)
    DB.close()

#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
addStandardPlayers()
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "<stdin>", line 5, in addStandardPlayers
: psycopg2.IntegrityError: duplicate key value violates unique constraint "players1_pkey"
: DETAIL:  Key (pid)=(1) already exists.

** create and call a function from orgmode?
if psycopg2 has already been imported above, need not be imported again.
#+BEGIN_SRC python :session *Python* :results output
# import psycopg2


def show_all():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    query = "select * from players1;"
    c.execute(query)
    rows = c.fetchall()
    for row in rows:
        print row
	
    DB.close()

#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
show_all()
#+END_SRC

#+RESULTS:
: (1, 'Bill Borzo                         ', 0, 0)
: (2, 'Jeff Jeffries                      ', 0, 0)
: (3, 'Dave Davies                        ', 0, 0)
: (4, 'Steve Stevens                      ', 0, 0)

*** 1
#+BEGIN_SRC python :session *Python* :results output
def deleteRows():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    query = "delete from players1;"
    c.execute(query)
    DB.close()

#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
deleteRows()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
show_all()
#+END_SRC

#+RESULTS:
: (1, 'Bill Borzo                         ', 0, 0)
: (2, 'Jeff Jeffries                      ', 0, 0)
: (3, 'Dave Davies                        ', 0, 0)
: (4, 'Steve Stevens                      ', 0, 0)

*** 2
#+BEGIN_SRC python :session *Python* :results output
showAllPLayers()
#+END_SRC

#+RESULTS:
: (1, 'Bill Borzo                         ', 0, 0)
: (2, 'Jeff Jeffries                      ', 0, 0)
: (3, 'Dave Davies                        ', 0, 0)
: (4, 'Steve Stevens                      ', 0, 0)

#+BEGIN_SRC python :session *Python* :results output
def deleteRows():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute("delete from players1 where pid = 1;")
    c.execute("select * from players1;")
    c.fetchall()
    c.execute("delete from players1;")>
    c.execute("select * from players1;")
    c.fetchall()
    DB.commit()
    DB.close()

#+END_SRC

#+RESULTS:




#+RESULTS:

** wrapper when single-value retrieval is necessary
arggg--don't 'print' (thanks for only showing us print statements in
the video)
#+BEGIN_SRC python :session *Python* :results output
# use this when no need to display anything
# def dbExecuteRetrievalWrapper(query_string):
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute(query_string)
    row = c.fetchone()
    print row
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
dbExecuteRetrievalWrapper("select count(*) from players1;")
#+END_SRC


#+RESULTS:
: (4L,)

#+BEGIN_SRC python :session *Python* :results output
# use this when no need to display anything
def dbExecuteRetrievalWrapper(query_string):
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute(query_string)
    row = c.fetchone()
    row_item = list(row)
    return int(row_item[0])
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
dbExecuteRetrievalWrapper("select count(*) from players1;")
#+END_SRC

#+RESULTS:
: 4

** wrapper when multi-entry retrieval is necessary

#+BEGIN_SRC python :session *Python* :results output
# use this when no need to display anything
def dbExecuteRetrievalWrapper_allrows(query_string):
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute(query_string)
    rows = c.fetchall()
    for row in rows:
        print row
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
dbExecuteRetrievalWrapper_allrows("select * from players1;")
#+END_SRC

#+RESULTS:
: (1, 'Bill Borzo                         ', 0, 0)
: (2, 'Jeff Jeffries                      ', 0, 0)
: (3, 'Dave Davies                        ', 0, 0)
: (4, 'Steve Stevens                      ', 0, 0)

*** wrapper when single-value retrieval is necessary
#+BEGIN_SRC python :session *Python* :results output
# use this when no need to display anything
def dbExecuteRetrievalWrapper(query_string):
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute(query_string)
    row = c.fetchone()
    print row
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
dbExecuteRetrievalWrapper("select count(*) from players1;")
#+END_SRC


#+RESULTS:
: (4L,)

*** wrapper when multi-entry retrieval is necessary

#+BEGIN_SRC python :session *Python* :results output
# use this when no need to display anything
def dbExecuteRetrievalWrapper_allrows(query_string):
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute(query_string)
    rows = c.fetchall()
    for row in rows:
        print row
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
dbExecuteRetrievalWrapper_allrows("select * from players1;")
#+END_SRC

#+RESULTS:
: (1, 'Bill Borzo                         ', 0, 0)
: (2, 'Jeff Jeffries                      ', 0, 0)
: (3, 'Dave Davies                        ', 0, 0)
: (4, 'Steve Stevens                      ', 0, 0)

*** hardcoding
#+BEGIN_SRC python :session *Python* :results output

def showAllPLayers():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    query = "select * from players2;"
    c.execute(query)
    rows = c.fetchall()
    # print rows
    for row in rows:
        print row

    DB.close()


#+END_SRC

#+RESULTS:



#+BEGIN_SRC python :session *Python* :results output
showAllPLayers()
#+END_SRC

#+RESULTS:
: (218, 'Fluttershy', 0, 1)
: (217, 'Twilight Sparkle', 1, 1)
: (220, 'Pinkie Pie', 0, 1)
: (219, 'Applejack', 1, 1)

*** refactor to use optional parameter
#+BEGIN_SRC python :session *Python* :results output

def showAllPLayers(table=players2):
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    query = "select * from players1;"
    c.execute(query)
    rows = c.fetchall()
    # print rows
    for row in rows:
        print row
    DB.close()


#+END_SRC

#+RESULTS:
#+begin_example
'org_babel_python_eoe'
*** try to understand this string substitution shit
#+BEGIN_SRC python :session *Python* :results output
def addPlayersDavidDavids():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute("INSERT INTO players2 (player_name) VALUES (%s)" % "'David Davids'")
    DB.commit()
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
addPlayersDavidDavids()
#+END_SRC

#+RESULTS:



#+BEGIN_SRC python :session *Python* :results output
def addPlayers(name):
    # nim = str(name)
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute("INSERT INTO players2 (player_name) VALUES (%s)" 
    DB.commit()
    DB.close()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
addPlayers('DickShit')
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "<stdin>", line 5, in addPlayers
: psycopg2.ProgrammingError: column "name" does not exist
: LINE 1: INSERT INTO players2 (player_name) VALUES (name)
:                                                    ^





#+BEGIN_SRC python :session *Python* :results output
addPlayers("player_name")
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "<stdin>", line 5, in addPlayers
: psycopg2.ProgrammingError: column "player_name" does not exist
: LINE 1: INSERT INTO players1 (player_name) VALUES (player_name)
:                                                    ^
: HINT:  There is a column named "player_name" in table "players1", but it cannot be referenced from this part of the query.

#+BEGIN_SRC python :session *Python* :results output
def addPlayersName():
    DB = psycopg2.connect("dbname=tourney_practice")
    c = DB.cursor()
    c.execute("INSERT INTO players1 (player_name) VALUES (%s)" % (,))
    DB.commit()
    DB.close()
#+END_SRC
*** example of use
#+BEGIN_SRC python :session *Python* :results output
playerStandings()
#+END_SRC
#+RESULTS:
: ('May Mays', 0)
: ('Bill Borzo', 0)
: ('Steve Stevens', 0)
: ('Dick Shapiro', 0)

*** refactor to use an optional parameter for table
#+BEGIN_SRC python :session *Python* :results output
def reportMatch(winner, loser, table=None):
    dbExecuteWrapper("""INSERT INTO %s VALUES (%s, %s) ;""", (table, winner, loser))
    dbExecuteWrapper("""update players2 set wins = wins + 1  from matches2 where players2.player_name = matches2.winner;""")
    dbExecuteWrapper("""update players2 set matches = matches + 1  from matches2 where players2.player_name = matches2.winner OR player2.player_name = matches2.loser;""")

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sql
update players2 set wins = wins + 1  from matches2 where players2.player_name = matches2.winner;
#+END_SRC

#+BEGIN_SRC python :session *Python* :results output
reportMatch('Bill Borzo', 'David Davids', table=matches2)
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: NameError: name 'matches2' is not defined

*** example of use
#+BEGIN_SRC python :session *Python* :results output
countPlayers()
#+END_SRC

#+RESULTS:
: 0

*** example of use
#+BEGIN_SRC python :session *Python* :results output
playerStandings()
#+END_SRC
#+RESULTS:
: [(2, 'Bill Borzo', 0, 0), (3, 'May Mays', 0, 0), (4, 'Melpomene Murray', 0, 0), (5, 'Randy Schwartz', 0, 0)]

*** add to python
#+BEGIN_SRC python :session *Python* :results output :tangle yes
def swissPairings():
    return dbExecuteRetrievalWrapper_allrows("select a.id, a.player_name, b.id, b.player_name from players2 as a, players2 as b where a.wins = b.wins and a.player_name != b.player_name and a.id < b.id")

#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
swissPairings()
#+END_SRC

#+RESULTS:
: [("Boots O'Neal", 'Diane Grant')]

#+BEGIN_SRC sql
select a.player_name, b.player_name from players2 as a, players2 as b where a.wins = b.wins and a.player_name != b.player_name and a.id < b.id
#+END_SRC
query needs player ids as well
#+BEGIN_SRC sql
select a.id, a.player_name, b.id, b.player_name from players2 as a, players2 as b where a.wins = b.wins and a.player_name != b.player_name and a.id < b.id
#+END_SRC
** test lines for testReportMatches
#+BEGIN_SRC python :session *Python* :results output
deleteMatches()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
deletePlayers()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
countPlayers()
#+END_SRC

#+RESULTS:
: 0

#+BEGIN_SRC python :session *Python* :results output
playerStandings()
#+END_SRC

#+RESULTS:
: []

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Twilight Sparkle")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Fluttershy")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Applejack")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Pinkie Pie")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
c = countPlayers()
print c
#+END_SRC

#+RESULTS:
: 
: 4



#+BEGIN_SRC python :session *Python* :results output
standings = playerStandings()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
[id1, id2, id3, id4] = [row[0] for row in standings]
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
standings
#+END_SRC

#+RESULTS:
: [(45, 'Twilight Sparkle', 1, 1), (47, 'Applejack', 1, 1), (46, 'Fluttershy', 0, 1), (48, 'Pinkie Pie', 0, 1)]

#+BEGIN_SRC python :session *Python* :results output
reportMatch(id1, id2)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
reportMatch(id3, id4)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
standings
#+END_SRC

#+RESULTS:
: [(37, 'Twilight Sparkle', 0, 0), (38, 'Fluttershy', 0, 0), (39, 'Applejack', 0, 0), (40, 'Pinkie Pie', 0, 0)]

#+BEGIN_SRC python :session *Python* :results output
pairings = swissPairings()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
len(pairings) != 2
#+END_SRC

#+RESULTS:
: True

#+BEGIN_SRC python :session *Python* :results output
[(pid1, pname1, pid2, pname2), (pid3, pname3, pid4, pname4)] = pairings

#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: ValueError: need more than 1 value to unpack

#+BEGIN_SRC python :session *Python* :results output
correct_pairs = set([frozenset([id1, id3]), frozenset([id2, id4])])
#+END_SRC

#+BEGIN_SRC python :session *Python* :results output
actual_pairs = set([frozenset([pid1, pid2]), frozenset([pid3, pid4])])
#+END_SRC

#+BEGIN_SRC python :session *Python* :results output
correct_pairs != actual_pairs
#+END_SRC

#+BEGIN_SRC python :session *Python* :results output
#registerPlayer("Chandra Nalaar")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
#[(id1, name1, wins1, matches1), (id2, name2, wins2, matches2)] = standings
#+END_SRC
**** line by line code
#+BEGIN_SRC python :session *Python* :results output
deleteMatches()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
deletePlayers()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Bruno Walton")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Boots O'Neal")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Cathy Burton")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
registerPlayer("Diane Grant")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
standings = playerStandings()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
[id1, id2, id3, id4] = [row[0] for row in standings]
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
reportMatch(id1, id2)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
reportMatch(id3, id4)
#+END_SRC

#+RESULTS:

#+COMMENT for testing playerStandings
#+BEGIN_SRC python :session *Python* :results output
standings = playerStandings()
#+END_SRC

#+RESULTS:
#+END_SRC
**** unique to swissPairings test code
#+BEGIN_SRC python :session *Python* :results output
pairings = swissPairings()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output
len(pairings) != 2
#+END_SRC

#+RESULTS:
: True

#+BEGIN_SRC python :session *Python* :results output
[(pid1, pname1, pid2, pname2), (pid3, pname3, pid4, pname4)] = pairings
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: ValueError: need more than 1 value to unpack

#+BEGIN_SRC python :session *Python* :results output
correct_pairs = set([frozenset([id1, id3]), frozenset([id2, id4])])
#+END_SRC

#+BEGIN_SRC python :session *Python* :results output
actual_pairs = set([frozenset([pid1, pid2]), frozenset([pid3, pid4])])
#+END_SRC

#+BEGIN_SRC python :session *Python* :results output
correct_pairs != actual_pairs
#+END_SRC
